Второй минимум
Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение второго минимального по величине элемента в этой последовательности, то есть элемента, который будет наименьшим, если из последовательности удалить наименьший элемент.

Последнее число 0 не учитывается. Гарантируется, что в последовательности есть хотя бы два элемента (кроме завершающего числа 0).

x=int(input())
min1=x
min2=x
while x != 0:
  x=int(input())
  if x !=0 and x<min1:
    min2=min1
    min1=x
  elif x !=0 and x<min2:
    min2=x 
print(min2)