Количество локальных максимумов
Элемент последовательности называется строгим локальным максимумом, если он строго больше предыдущего и последующего элементов последовательности. Первый и последний элемент последовательности не являются локальными максимумами.

Входные данные

Дана последовательность натуральных чисел, завершающаяся числом 0. Гарантируется, что все числа не превосходят 100.

Выходные данные

Определите количество строгих локальных максимумов в этой последовательности.
x=int(input())
kol=0
pred=x
pred1=pred
while x != 0:
  x=int(input())
  if x!=0:
    if x<pred and pred>pred1:
      kol+=1
  pred1=pred  
  pred=x
print(kol)