Номер числа Фибоначчи
Последовательность Фибоначчи определяется так:

ϕ0=0,ϕ1=1,ϕn=ϕn−1+ϕn−2
Дано натуральное число A. Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что ϕn=A. Если A не является числом Фибоначчи, выведите число −1.

Входные данные

Вводится натуральное число A (2≤A≤2∗109).

Выходные данные

Выведите ответ на задачу.


x=int(input())
k=0
l=1
ch=1
n=1 
while n<x:
  n = k+l
  k = l
  l = n
  ch+=1
print(ch if n==x else -1)