Самое частое число в последовательности
Последовательность состоит из натуральных чисел, причем какое-то из чисел составляет более половины от общего числа членов последовательности. Найдите это число.

Для решения этой задачи запрещено использование массивов и списков.

Входные данные

На вход подается последовательность натуральных чисел, заканчивающаяся нулём. Его обрабатывать не нужно. Гарантируется, что все числа не превосходят 109.

x=int(input())
ans = 0
count = 0
while x != 0:
  if count ==0:
    ans = x
    count+=1
  elif ans==x:
    count+=1
  else:
    count-=1
  x=int(input())
print(ans)